import streamlit as st
st.title("入门演示")
st.header("一级标题")
st.subheader("二级标题")
#段落文字
st.write("布偶猫,被誉为“猫中仙女”")
st.write("以其优雅的外表和温顺的性格成为最受欢迎的宠物猫之一")
st.write("它们体型较大,成年后可达10-20斤,拥有深邃的蓝色眼眸和柔顺的中长毛,毛色多为双色、手套色或重点色,宛如戴着一副可爱的面具。")
st.write("最迷人的是其松弛柔软的体态,当你拍起它时,它会像布偶一样全身放松,信赖地偎依在主人怀中,“布偶”之名便由此而来")

#图片
st.image("./resources/cat.jpg")
#视频
st.video("resources/8.15瑞幸.mp4")
#音频
st.audio("resources/嗜好伴奏.wav")
#表格
student_data = {
    "姓名":["王林","王1","王2","王3","王4"],
    "学号":["1111",'22222','33333','33344','5555'],
    "语文":["133",'1334','144','344','444']                      
}
st.table(student_data)
#输入框
